// Поддерживаются только вопросы с одним вариантом ответа.
// Вопрос и ответ должны быть на разных строках. Между вопросами должны быть пустые строки. Перед первым вопросом должна быть пустая строка.

// const rawQnas = `
//
// Как смачно сосать хуй
// А вот так
//
// Что такое залупа
// Это хуй
// `;

const rawQnas = `

Коэффициент обновления основных средств рассчитывается как:
отношение поступивших основных средств к стоимости основных средств на конец года

Рекомендуемое значение коэффициента маневренности собственных средств составляет:
равное 0,5

Задачами анализа использования основных средств являются:
все вышеперечисленные задачи

Какой источник информации не используются для анализа затрат на производство продукции?:
форма №1-ф (ос) «Отчет о наличии и движении основных средств и других долгосрочных активов»

Прибыль от текущей деятельности рассчитывается как:
прибыль от реализации продукции плюс прочие доходы от текущей деятельности и минус прочие расходы от текущей деятельности

К переменной части фонда заработной платы не относится:
зарплата служащих по окладам

Коэффициент обеспеченности запасов и затрат собственными оборотными средствами рассчитывается как:
отношение собственных оборотных средств к запасам и затратам

В ходе анализа динамики производства и реализации продукции рассчитываются следующие показатели:
цепные и базисные темпы роста, темпы прироста и среднегодовые темпы роста произведенной и реализованной продукции за период

Какие факторы влияют на изменение прямых материальных и трудовых затрат?:
все приведенные варианты верны

В активе баланса отражается:
стоимость имущества и долговых прав, которыми располагает организация на отчетную дату

Ассортимент – это:
перечень наименований видов продукции с указанием количества по каждому из них

В каком из ответов приведен наиболее полный перечень источников информации для анализа производства и реализации продукции?
форма №12-п «Отчет о производстве промышленной продукции (работ, услуг), ф.№4-п (натура) «Отчет о производстве промышленной продукции (оказании услуг промышленного характера)», бухгалтерский баланс», отчет о прибы¬лях и убытках, ведомость № 16 «Движение готовых изделий, их отгрузка и реализация», журнал-ордер №11, карточки складского учета готовой продукции

Рентабельность собственного капитала рассчитывается как:
отношение прибыли до налогообложения или чистой прибыли к средней величине собственного капитала

Рекомендуемое значение коэффициента запасов и затрат собственными оборотными средствами составляет:
в пределах 0,6-0,8

Коэффициент маневренности собственных средств рассчитывается как:
отношение собственных оборотных средств к собственному капиталу

Коэффициент использования парка наличного оборудования рассчитывается как:
отношение количества действующего оборудования к количеству наличного оборудования

Сокращение потерь рабочего времени является резервом:
увеличения выпуска продукции

Коэффициент использования оборудования сданного в эксплуатацию рассчитывается как:
отношение количества установленного оборудования к количеству наличного оборудования

Влияние струк¬турных сдвигов на экономи¬ческие показатели определяется как:
разница между фактическим выпуском продукции при фактической структуре и фактическим выпуском продукции, засчитанным в выполнение плана

Бухгалтерский баланс – это:
способ отражения в денежной оценке имущества организации по составу и источникам его финансирования на определенную дату

Эффект финансового рычага (ЭФР) рассчитывается по следующей формуле:
(R сов.кап. «минус» Ссудный Процент) «умножить» (1«минус» Кналогообл.) «умножить» (ЗК «разделить» СК)

К качественным показателям деловой активности относятся:
все перечисленные показатели

Удельная материалоемкость изделия рассчитывается как:
отношение стоимости всех потребленных на изделие материалов к цене изделия

Факторный анализ изменения объема реализации продукции рассчитываются приемом:
балансовым

Коэффициент срочной (критической) ликвидности рассчитывается как:
отношение суммы денежных средств, краткосрочных финансовые вложений и дебиторкой задолженности к краткосрочным обязательствам

Трудоёмкость – это:
затраты рабочего времени на единицу продукции и (или) затраты рабочего времени на весь объём изготовленной продукции

Сырьеемкость продукции рассчитывается как:
отношение стоимости потребленных сырья и материалов к стоимости выпущенной продукции

В систему показателей деловой активности входят следующие группы показателей:
количественные и качественные

Рекомендуемое значение коэффициента срочной (критической) ликвидности составляет:
в пределах 0,7-1

Основным нормативным документом, регулирующим порядок расчета коэффициентов платежеспособности является:
инструкция о порядке расчета коэффициентов платежеспособности и проведения анализа финансового состояния и платежеспособности субъектов хозяйствования № 140/206

Затраты на рубль товарной продукции рассчитывается как:
отношение затрат на производс¬тво и реализацию продукции к стоимости выпуска продукции в дейс¬твующих ценах

В баланс рабочего времени одного рабочего не включается фонд рабочего времени:
Праздничный

К математическим методам можно отнести методы:
Все вышеперечисленные методы

Фондовооруженность труда работников предприятия рассчитывается как:
отношение среднегодовой стоимости основных средств к среднесписочной численности промышленно–производственного персонала

Какой показатель не используется при оценке качества и ликвидности дебиторской задолженности?:
удельный вес денежных средств на расчетном счете в их общей сумме

Эффект финансового рычага показывает:
на сколько процентов изменяется рентабельность совокупного капитала за счет привлечения заемных средств в оборот организации

На какие экономические показатели оказывает влияние изменение структуры производства и реализации продукции?:
все вышеперечисленные показатели

Какие свойства характеризуют единичные (индивидуальные) показатели качества продукции?:
все вышеперечисленные свойства

Баланс считается ликвидным, если имеют место следующие соотношения:
А1>П1, А2>П2, А3>П3, А4<П4

Коэффициент выбытия основных средств рассчитывается как:
отношение выбывших основных средств к стоимости основных средств на начало года

Оценка выполнения плана по производству продукции осуществляется путем сравнения:
фактического объема с плановым по каждому виду выпускаемой продукции:

В каком ответе приведен наиболее точный перечень статей первого раздела баланса «Долгосрочные активы»:
основные средства, нематериальные активы, доходные вложения в материальные активы, вложения в долгосрочные активы, долгосрочные финансовые вложения, отложенные налоговые активы, долгосрочная дебиторская задолженность, прочие долгосрочные активы

Показатель выхода продукции на 1м2 производственной площади рассчитывается как:
отношение объема выпущенной продукции к производственной площади

Рентабельность единицы отдельного вида продукции рассчитывается как:
отношение прибыли на единицу данного вида продукции к её цене

Рентабельность совокупных активов рассчитывается как:
отношение прибыли до налогообложения или чистой прибыли к средней величине активов организации

Собственные оборотные средства - это:
часть собственного капитала, которая направляется на формирование краткосрочных активов

Чистые активы рассчитываются как:
разница между суммой активов организации, принимаемых к расчету и суммой ее долговых обязательств, принимаемых к расчету

Удельная материалоемкость изделия рассчитывается как:
отношение стоимости всех потребленных на изделие материалов к цене изделия

Неплатежеспособность, приобретающая устойчивый характер возникает если:
коэффициент текущей ликвидности и коэффициент обеспе¬ченности собственными оборотными средствами в течение четырех кварталов, предшествующих составлению последнего баланса одновременно имеют значения менее норматив¬ных

Ассортимент – это:
перечень наименований видов продукции с указанием количества по каждому из них

Какие свойства характеризуют единичные (индивидуальные) показатели качества продукции?:
все вышеперечисленные свойства

Финансовое состояние организации – это:
комплексное понятие, характеризую¬щееся системой показателей, отражающих наличие, размещение и использование финансовых ресурсов организации

Финансовая устойчивость организации - это:
такое состояние ее финансовых ресурсов, которое обеспечивает развитие организации преимущественно за счет собственных средств при сохранении платежеспособности и кредитоспособности и минимальном уровне предпринимательского риска

Прибыль от реализации продукции рассчитывается как:
валовая прибыль минус управленческие расходы и расходы на реализацию

К частным показателям эффективности использования материальных ресурсов относятся:
сырьеемкость, металлоемкость, топливоемкость, энергоемкость

При проведении горизонтального анализа показателей бухгалтерского баланса определяются:
абсолютные и относительные отклонения статей баланса по сравнению с началом отчетного периода или прошлыми периодами

Рентабельность единицы отдельного вида продукции рассчитывается как:
отношение прибыли на единицу данного вида продукции к её цене

Коэффициент оборота по выбытию рассчитывается как:
отношение количества выбывших работников к среднесписочной численности работников

Эффект финансового рычага принимает значение:
положительное и отрицательное

Рентабельность инвестированного капитала рассчитывается как:
отношение прибыли до налогообложения или чистой прибыли к сумме собственного капитала и долгосрочного заемного капитала

Сокращение потерь рабочего времени является резервом:
увеличения выпуска продукции

Какой показатель не используется при оценке качества и ликвидности дебиторской задолженности?:
удельный вес денежных средств на расчетном счете в их общей сумме

Какие показатели рассчитываются для оценки соответствия квалификации рабочих сложности выполняемых работ по участку, цеху?:
средний тарифный разряд работ и средний тарифный разряд рабочих

Коэффициент выполнения договорных обязательств рассчитывается по формуле:
отношение разницы между плановым объемом реализации продукции по заключенным договорам и недопоставленной продукцией к плановому объему реализации продукции

Коэффициент обеспеченности собственными оборотными средствами рассчитывается как:
отношение собственных оборотных средств к активу баланса

Под качеством дебиторской задолженности организации понимается:
вероятность погашения задолженности в полном объеме

К качественным показателям деловой активности относятся:
все перечисленные показатели

Рекомендуемое значение коэффициента капитализации составляет:
не более единицы

Затраты на рубль товарной продукции рассчитывается как:
отношение затрат на производс¬тво и реализацию продукции к стоимости выпуска продукции в дейс¬твующих ценах

В баланс рабочего времени одного рабочего не включается фонд рабочего времени:
Праздничный

Какие затраты не включаются в состав постоянных затрат?:
расходы на сырьё и материалы

Коэффициент оборачиваемости запасов рассчитывается как:
отношение выручки от реализации продукции к средней величине запасов

Коэффициент текучести кадров рассчитывается как:
отношение количества работников, уволившихся по собственному желанию и за нарушение трудовой дисциплины к среднесписочной численности работников

Показатель трудоемкости на единицу продукции рассчитывается как:
отношение фонда рабочего времени на изготовление i-го вида изделий к количеству изделий одного наименования в натуральном выражении

Коэффициент сбалансированности денежных потоков рассчитывается как:
отношение поступления денежных средств за отчетный период к расходованию денежных средств за отчетный период

Потребность в завозе материальных ресурсов со стороны определяется как:
разница между общей потребностью в i-м виде материальных ресурсов и суммой внутренних источников ее покрытия

Какие свойства характеризуют единичные (индивидуальные) показатели качества продукции?:
все вышеперечисленные свойства

Прибыль от текущей деятельности рассчитывается как:
прибыль от реализации продукции плюс прочие доходы от текущей деятельности и минус прочие расходы от текущей деятельности

Материалорентабельность рассчитывается как:
отношение прибыли от реализации продукции к материальным затратам

В систему показателей деловой активности входят следующие группы показателей:
количественные и качественные

Коэффициент постоянства кадров рассчитывается как:
отношение количества работников, проработавших год к среднесписочной численности работников

Какой показатель прибыли не включается в отчет о прибылях и убытках?:
прибыль от реализации экспортной продукции

Какой источник информации не используются для анализа материальных ресурсов?:
форма № 12-Т “Отчет по труду”

Структура кадров в разрезе всех подразделений предприятия анализируется по таким признакам как:
по всем вышеперечисленным признакам

Рентабельность совокупных активов рассчитывается как:
отношение прибыли до налогообложения или чистой прибыли к средней величине активов организации

Материалоотдача продукции рассчитывается как:
отношение стоимости выпущенной продукции к материальным затратам

При изучении и оценке показателей бухгалтерского баланса используются следующие виды  анализа:
горизонтальный, вертикальный, трендовый

Основными источниками резервов снижения себестоимости промышленной продукции являются:
верны второй и третий ответы

Рекомендуемое значение коэффициента финансовой независимости (автономии) составляет:
в пределах 0,4-0,6

Под краткосрочной платежеспособностью понимается:
способность организации рассчитаться по своим краткосрочным обязательствам
`;

const qnas = rawQnas
  .split("\n\n")
  .slice(1)
  .map((rawQna) => {
    const question = rawQna.split("\n")[0].trim().toLowerCase();
    const answer = rawQna.split("\n")[1].trim().toLowerCase();
    return { question, answer };
  });

console.log(qnas);

const questionElements = Array.from(
  document.querySelector('#region-main > [role="main"] > form > div')
    .childNodes,
).filter((testElement) => testElement.id.includes("question-"));
for (const questionElement of questionElements) {
  const questionText = questionElement
    .querySelector(".qtext")
    .innerText.trim()
    .toLowerCase();

  const answerText = qnas.find((qna) =>
    questionText.includes(qna.question),
  )?.answer;
  if (answerText === undefined) {
    console.log(`Неизвестный вопрос "${questionText}".`);
    continue;
  }

  const answerOptions = Array.from(
    questionElement.querySelectorAll(".answer > div"),
  );

  const exactMatchAnswerOption = answerOptions.find((answerOption) => {
    const answerLabel = answerOption
      .querySelector("label")
      .innerText.trim()
      .toLowerCase();
    return answerLabel === answerText;
  });
  if (exactMatchAnswerOption !== undefined) {
    exactMatchAnswerOption.querySelector("label").innerText += ".";
    continue;
  }

  const partialMatchAnswerOptions = answerOptions.filter((answerOption) => {
    const answerLabel = answerOption
      .querySelector("label")
      .innerText.trim()
      .toLowerCase();
    return answerLabel.includes(answerText);
  });

  if (partialMatchAnswerOptions.length === 1) {
    const singlePartialMatchAnswerOption = partialMatchAnswerOptions[0];
    singlePartialMatchAnswerOption.querySelector("label").innerText += ".";
    continue;
  }

  console.log(`Нет подходящего варианта ответа для вопроса "${questionText}".`);
  questionElement.querySelector(".qtext").style.marginBottom = 0;
  questionElement.querySelector(".ablock").style.marginTop = 0;
  const answerElement = document.createElement("div");
  answerElement.style.opacity = 0;
  answerElement.innerText = answerText;
  answerElement.addEventListener("click", function () {
    answerElement.style.opacity = 1 - answerElement.style.opacity;
  });
  questionElement
    .querySelector(".qtext")
    .insertAdjacentElement("afterend", answerElement);
}
